/**
  ******************************************************************************
  * @file    key.c
  * @brief   这个文件提供了按键处理函数
  ******************************************************************************
  */
#include "key.h"

/********************************************************
* Function name ：Key_Scan
* Description   : 按键处理函数
* Parameter     ：mode:0,不支持连续按;1,支持连续按;
* Return        ：0，没有任何按键按下
		        1，KEY0按下
		        2，KEY1按下
**********************************************************/
uint8_t Key_Scan(uint8_t mode)
{
    static uint8_t key_up=1;	//按键按松开标志
    if(mode)	key_up=1;			//支持连按
    if(key_up && (KEY0() == 0 || KEY1() == 0))
    {
        HAL_Delay(10);		//去抖动
        key_up=0;
        if(KEY0() == 0)	        return 1;
        else if(KEY1() == 0)	return 2;
    }else if(KEY0() == 1 && KEY1() == 1)	key_up=1;
    return 0;					//无按键按下
}